Tekla.Structures.Model.Part.CastUnitTypeEnum
The cast unit types.

Tekla.Structures.Model.Part.CastUnitTypeEnum.PRECAST
The precast cast unit type.

Tekla.Structures.Model.Part.CastUnitTypeEnum.CAST_IN_PLACE
The cast in place cast unit type.